CREATE TABLE products ( 
    product_id INT, 
    sku VARCHAR ( 100 ), 
    product_name VARCHAR ( 255 ), 
    category VARCHAR ( 100 ), 
    price DECIMAL ( 10 , 2 ), 
    created_at TIMESTAMP 
);

INSERT INTO products VALUES
(1, 'SKU001', 'Ноутбук', 'Электроника', 50000.00, '2026-01-10'),
(2, 'SKU002', 'Мышь', 'Электроника', 1500.00, '2026-01-15'),
(3, 'SKU001', 'Ноутбук Asus', 'Электроника', 55000.00, '2026-02-01'),
(4, 'SKU003', 'Клавиатура', 'Электроника', 3000.00, '2026-02-10'),
(5, 'SKU002', 'Мышь беспроводная', 'Электроника', 2000.00, '2026-03-01'),
(6, 'SKU001', 'Ноутбук MSI', 'Электроника', 60000.00, '2026-04-01');
